### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
# Creating a DataFrame
data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 27],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df1 = pd.DataFrame(data1)

# Displaying the DataFrame
print("DataFrame:")
print(df1)
print("\nDataFrame Columns:")
print(df1.columns)

# Accessing a specific column as a Series
age_series = df1['Age']

# Displaying the Series
print("\nSeries (Age column):")
print(age_series)

DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   27    Los Angeles

DataFrame Columns:
Index(['Name', 'Age', 'City'], dtype='object')

Series (Age column):
0    25
1    30
2    27
Name: Age, dtype: int64

#### 1. head() and tail(): Display the first or last n rows of the DataFrame.

In [2]:
df1.head(1)

    Name  Age      City
0  Alice   25  New York

In [3]:
df1.tail(1)

      Name  Age         City
2  Charlie   27  Los Angeles

#### 2. info(): Display a concise summary of the DataFrame, including data types, non-null counts, and memory usage.

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

#### 3. describe(): Generate descriptive statistics (count, mean, std deviation, min, 25%, 50%, 75%, max) of numerical columns.

In [5]:
df1.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

#### 4. shape: Return the dimensions (rows, columns) of the DataFrame.

In [6]:
df1.shape

(3, 3)

#### 5. columns and index: Access the column names and index of the DataFrame.

In [7]:
df1.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [8]:
df1.index

RangeIndex(start=0, stop=3, step=1)

#### 6. loc[] and iloc[]: Access a group of rows and columns by labels (loc[]) or integer-based indexing (iloc[]).

In [9]:
df1.loc[1:3, ['Name', 'Age']]

      Name  Age
1      Bob   30
2  Charlie   27

In [10]:
df1.iloc[1:2]

  Name  Age           City
1  Bob   30  San Francisco

#### 7. sort_values(): Sort the DataFrame by one or more columns.

In [11]:
df1.sort_values(by='Age', ascending=False)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   27    Los Angeles
0    Alice   25       New York

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
data_frame = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})

In [13]:
def reindex_with_custom_index(df):
    # Create a new index starting from 1 and incrementing by 2
    new_index = range(1, len(df) * 2, 2)

    # Set the new index and create a new DataFrame
    df_reindexed = df.reset_index(drop=True)
    df_reindexed.index = new_index

    return df_reindexed

# Re-index the DataFrame using the custom index
df_reindexed = reindex_with_custom_index(data_frame)

# Display the re-indexed DataFrame
print(df_reindexed)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. 
#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [14]:
data_frame3 = pd.DataFrame({'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100], 
                            'Name': ["Alpha1", "Alpha2", "Alpha3", "Alpha4", "Alpha5", "Alpha6", "Alpha7", "Alpha8", "Alpha9", "Alpha10"]
                           })

In [15]:
data_frame3["Values"].iloc[0:3].sum()

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [16]:
data_frame4 = pd.DataFrame({'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100], 
                            'Name': ["Alpha1", "Alpha2", "Alpha3", "Alpha4", "Alpha5", "Alpha6", "Alpha7", "Alpha8", "Alpha9", "Alpha10"]
                           })

In [17]:
def word_count(n):
    return len(str(n).split())

In [18]:
data_frame4["Text"] = [
    'This is a sample text for the first row.',
    'Another example in the second row.',
    'Adding more text to the third row.',
    'Short Text 1',
    'Short Text 2',
    'Short Text 3',
    'Short Te xt 4',
    'Sho rtT ex t 5',
    'Shor t T e  xt 6',
    'please refer to the above text'
]

In [19]:
data_frame4["Word_Count"] = data_frame4["Text"].apply(word_count)

In [20]:
data_frame4

   Values     Name                                      Text  Word_Count
0      10   Alpha1  This is a sample text for the first row.           9
1      20   Alpha2        Another example in the second row.           6
2      30   Alpha3        Adding more text to the third row.           7
3      40   Alpha4                              Short Text 1           3
4      50   Alpha5                              Short Text 2           3
5      60   Alpha6                              Short Text 3           3
6      70   Alpha7                             Short Te xt 4           4
7      80   Alpha8                            Sho rtT ex t 5           5
8      90   Alpha9                          Shor t T e  xt 6           6
9     100  Alpha10            please refer to the above text           6

### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [21]:
data_frame4.shape

(10, 4)

In [22]:
data_frame4.size

40

As we can clearly see in above example that the shape will tell us about the shape of datatframe which means the number of columns and number of rows and size tells us about the total values in a dataframe i.e., no. of coulumns * number of rows.

### Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("test.xls")

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [23]:
s = "username@gmail.com"
j = s.split('@')[0]

In [24]:
j

'username'

In [25]:
def split_username(n):
    return n.split('@')[0]
def first_username(n):
    return n.split('.')[0]
def last_username(n):
    return n.split('.')[1]

In [26]:
data_frame7 = pd.DataFrame({"Email": ["john.doe@example.com", 
                                      "alice.smith@gmail.com", 
                                      "bob.jones@hotmail.com",
                                      "emma.white@yahoo.com",
                                      "david.miller@outlook.com",
                                      "olivia.jackson@gmail.com",
                                      "charlie.brown@example.com",
                                      "sophie.martin@yahoo.com",
                                      "lucas.wilson@hotmail.com",
                                      "mia.johnson@outlook.com"]})

In [27]:
data_frame7["Username"] = data_frame7["Email"].apply(split_username)
data_frame7["First_name"] = data_frame7["Username"].apply(first_username)
data_frame7["Last_name"] = data_frame7["Username"].apply(last_username)

In [28]:
data_frame7

                       Email        Username First_name Last_name
0       john.doe@example.com        john.doe       john       doe
1      alice.smith@gmail.com     alice.smith      alice     smith
2      bob.jones@hotmail.com       bob.jones        bob     jones
3       emma.white@yahoo.com      emma.white       emma     white
4   david.miller@outlook.com    david.miller      david    miller
5   olivia.jackson@gmail.com  olivia.jackson     olivia   jackson
6  charlie.brown@example.com   charlie.brown    charlie     brown
7    sophie.martin@yahoo.com   sophie.martin     sophie    martin
8   lucas.wilson@hotmail.com    lucas.wilson      lucas    wilson
9    mia.johnson@outlook.com     mia.johnson        mia   johnson

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
#### For example, if df contains the following values:

_  A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

#### Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2


#### The function should return a new DataFrame that contains only the selected rows

#### There are several ways to perform the abobe scenario please refer to the following:

In [29]:
data_frame8 = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})

In [30]:
data_frame8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [31]:
data_frame_result1 = data_frame8.where((data_frame8["A"] > 5) & (data_frame8["B"] < 10)).dropna()

In [32]:
data_frame_result1

     A    B    C
1  8.0  2.0  7.0
2  6.0  9.0  4.0
4  9.0  1.0  2.0

In [33]:
data_frame_result2 = data_frame8[(data_frame8["A"] > 5) & (data_frame8["B"] < 10)].dropna()

In [34]:
data_frame_result2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [35]:
data_frame_result3 = data_frame8.query("A > 5 and B < 10").dropna()

In [36]:
data_frame_result3

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [37]:
data_frame9 = pd.DataFrame({'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 60], 
                            'Name': ["Alpha1", "Alpha2", "Alpha3", "Alpha4", "Alpha5", "Alpha6", "Alpha7", "Alpha8", "Alpha9", "Alpha10", "Alpha11"]
                           })

In [38]:
# Calculating Mean
data_frame9["Values"].mean()

55.45454545454545

In [39]:
# Calculating Median
data_frame9["Values"].median()

60.0

In [40]:
# Calculating Mode
data_frame9["Values"].mode()

0    60
Name: Values, dtype: int64

In [41]:
# Calculating Standard Deviation
data_frame9["Values"].std()

28.762349126466138

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [48]:
def add_moving_average_column(df):
    # Sort the DataFrame by 'Date' if not already sorted
    df.sort_values('Date', inplace=True)

    # Calculate the 7-day moving average
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

df10 = pd.DataFrame({'Date': ['2022-01-01', '2022-01-02', '2022-01-31'],'Sales': [10, 15, 20]})

# Convert 'Date' column to datetime if it's not already in datetime format
df10['Date'] = pd.to_datetime(df['Date'])

# Add the 'MovingAverage' column to the DataFrame
df_with_ma = add_moving_average_column(df10)

# Display the DataFrame with the new 'MovingAverage' column
print(df_with_ma)

        Date  Sales  MovingAverage
0 2023-01-01     10           10.0
1 2023-01-02     15           12.5
2 2023-01-03     20           15.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

#### For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

#### Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

#### The function should return the modified DataFrame

In [49]:
def add_weekday_column(df):
    # Convert 'Date' column to datetime if it's not already in datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Add the 'Weekday' column with weekday names
    df['Weekday'] = df['Date'].dt.strftime('%A')

    return df

df11 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

# Add the 'Weekday' column to the DataFrame
df_with_weekday = add_weekday_column(df11)

# Display the DataFrame with the new 'Weekday' column
print(df_with_weekday)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [56]:
def select_rows_between_dates(df):
    # Convert 'Date' column to datetime if it's not already in datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Define the start and end dates
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    # Use boolean indexing to select rows between the specified dates
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return selected_rows

df12 = pd.DataFrame({'Date': ['2023-01-01', '2024-01-02', '2023-01-03', '2024-01-04', '2020-01-05', '2023-01-06', '2020-01-07', '2023-01-08', '2023-01-09', '2023-01-10',
                             '2021-01-11', '2023-01-12', '2023-01-13', '2025-01-14', '2023-01-15', '2024-01-16', '2023-01-17', '2021-01-18', '2023-01-19', '2023-01-20',
                             '2021-01-21', '2024-01-22', '2022-01-23', '2029-01-24', '2023-01-25', '2025-01-26', '2026-01-27', '2023-01-28', '2023-01-29', '2020-01-30', '2023-01-31']})

selected_rows = select_rows_between_dates(df12)

# Display the selected rows
print(selected_rows)

         Date
0  2023-01-01
2  2023-01-03
5  2023-01-06
7  2023-01-08
8  2023-01-09
9  2023-01-10
11 2023-01-12
12 2023-01-13
14 2023-01-15
16 2023-01-17
18 2023-01-19
19 2023-01-20
24 2023-01-25
27 2023-01-28
28 2023-01-29
30 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### To use the basic functions of pandas, the first and foremost library that needs to be imported is the pandas library itself. You typically import it with the conventional alias pd. Here's the common import statement:

In [57]:
import pandas as pd